[
  {
    "id": "exp-1",
    "company": "TARYAN GROUP",
    "logo": "/images/companies/taryan-logo.png",
    "position": "IT Administrator",
    "period": "June 2024 - Present",
    "location": "Bali, Indonesia",
    "type": "full-time",
    "description": "Leading performance marketing and AI-driven automation at TARYAN GROUP. Developed sales agents and workflows that boosted conversion rates by 40%, managing multi-channel campaigns and advanced analytics.",
    "technologies": ["Mikrotik", "AI/ML", "CRM", "Cloud Server", "Database", "Automation", "Microsoft", "Google Workspace", "API Integration"],
    "responsibility": [
      "Manage and maintain network infrastructure using Mikrotik systems",
      "Develop and implement AI/ML solutions for business automation",
      "Oversee CRM systems and database management for lead processing",
      "Administer cloud servers and ensure system security and performance",
      "Create automated workflows for sales and marketing processes",
      "Manage Microsoft and Google Workspace environments for team collaboration",
      "Integrate APIs between different business systems and platforms"
    ]
  },
  {
    "id": "exp-2",
    "company": "AMO World",
    "logo": "/images/companies/amo-world-logo.png",
    "position": "SEO Specialist",
    "period": "Jan 2024 - Present",
    "location": "Remote",
    "type": "freelance",
    "description": "Bridged IT and marketing operations at AMO World with data-driven solutions and custom integrations. Maintained server infrastructure and ensured data security compliance.",
    "technologies": ["Google Ads", "Google Analytics", "WordPress", "CRM Systems", "API Integration", "Linux", "Docker"],
    "responsibility": [
      "Optimize website SEO performance and search engine rankings",
      "Manage Google Ads campaigns and budget allocation",
      "Implement and maintain Google Analytics tracking systems",
      "Develop and maintain WordPress websites and content management",
      "Integrate CRM systems with marketing platforms for lead tracking",
      "Manage Linux servers and Docker containerization for web applications",
      "Create API integrations between different marketing and business tools"
    ]
  },
  {
    "id": "exp-3",
    "company": "Hi-Human Group",
    "logo": "/images/companies/hihuman-logo.jpeg",
    "position": "IT Remote Solutions Architect",
    "period": "Jun 2021 - Dec 2021",
    "location": "Remote",
    "type": "freelance",
    "description": "Provided IT consulting for SMBs at Hi-Human Group, optimizing marketing tech stacks with automation, analytics, and performance enhancements across e-commerce, SaaS, and professional services.",
    "technologies": ["HubSpot", "Zapier", "Google Analytics", "WordPress", "Shopify", "Email Marketing"],
    "responsibility": [
      "Provide IT consulting services for small to medium businesses",
      "Design and implement marketing technology stack solutions",
      "Configure CRM and automation workflows for clients",
      "Set up Zapier integrations for business process automation",
      "Implement Google Analytics and conversion tracking systems",
      "Develop custom WordPress solutions and e-commerce platforms",
      "Design and execute email marketing campaigns and automation sequences"
    ]
  },
  {
    "id": "exp-4",
    "company": "SETTER Co-Working Space",
    "logo": "/images/companies/techcorp.png",
    "position": "IT Manager",
    "period": "Aug 2023 - Jun 2024",
    "location": "Bali, Indonesia",
    "type": "full-time",
    "description": "Managed IT infrastructure for SETTER Co-Working Space, overseeing network operations, member systems, and tech services for seamless connectivity and efficiency.",
    "technologies": ["Mikrotik", "Unifi", "Nexudus CMS", "Webflow", "CRM", "NMS", "KaaS"],
    "responsibility": [
      "Manage and maintain network infrastructure using Mikrotik and Unifi systems",
      "Administer Nexudus CMS for member management and billing operations",
      "Develop and maintain company website using Webflow",
      "Implement and oversee CRM systems for member relationship management",
      "Manage Network Management Systems (NMS) for monitoring and troubleshooting",
      "Administer KaaS (Keyboard as a Service) solutions for members",
      "Provide IT support and technical assistance to co-working space members"
    ]
  },
  {
    "id": "exp-5",
    "company": "Red Cubic Technology",
    "logo": "/images/companies/dma.png",
    "position": "IT Supervisor",
    "period": "Nov 2021 - Aug 2023",
    "location": "Bali, Indonesia",
    "type": "full-time",
    "description": "Supervised IT operations and network infrastructure at Red Cubic Technology, leading system implementations and managing teams for reliable tech services.",
    "technologies": ["Mikrotik", "WordPress", "PowerPro", "VHP", "Hikvision", "Network Infrastructure"],
    "responsibility": [
      "Supervise IT team and coordinate network infrastructure projects",
      "Implement and manage Mikrotik-based network solutions",
      "Develop and maintain WordPress websites for clients",
      "Administer PowerPro and VHP systems for business operations",
      "Deploy and manage Hikvision security and surveillance systems",
      "Design and implement comprehensive network infrastructure solutions",
      "Provide technical leadership and mentorship to IT staff"
    ]
  },
  {
    "id": "exp-6",
    "company": "PT. Solusindo Bintang Pratama Network",
    "logo": "/images/companies/freelance.png",
    "position": "Help Desk Support",
    "period": "Oct 2020 - Aug 2023",
    "location": "Bali, Indonesia",
    "type": "full-time",
    "description": "Provided technical support and troubleshooting for network clients at PT. Solusindo Bintang Pratama Network, assisting with configurations, maintenance, and enterprise issues.",
    "technologies": ["Mikrotik", "Cisco", "Solar Winds", "CRM"],
    "responsibility": [
      "Provide first-level technical support and troubleshooting assistance",
      "Configure and maintain Mikrotik and Cisco network equipment",
      "Utilize Solar Winds for network monitoring and performance management",
      "Manage customer relationships through CRM systems",
      "Document technical solutions and create knowledge base articles",
      "Assist with network installation and configuration projects",
      "Coordinate with senior technical staff for complex issue resolution"
    ]
  }
]